Revit 2026 API

# AdvancedGlazingGlazingBackfaceCulling Property

---

The property labeled "Backface Culling" from the "AdvancedGlazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string GlazingBackfaceCulling { get; }
```
```vb
Public Shared ReadOnly Property GlazingBackfaceCulling As String
	Get
```
```cpp
public:
static property String^ GlazingBackfaceCulling {
	String^ get ();
}
```
```fsharp
static member GlazingBackfaceCulling : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace